anysphere.cursorpyright
anysphere.remote-ssh
bierner.markdown-mermaid
bmewburn.vscode-intelephense-client
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bung87.rails
bung87.vscode-gemfile
castwide.solargraph
chouzz.vscode-better-align
crystal-lang-tools.crystal-lang
dbaeumer.vscode-eslint
eamodio.gitlens
emallin.phpunit
eriklynd.json-tools
esbenp.prettier-vscode
file-icons.file-icons
firsttris.vscode-jest-runner
formulahendry.auto-rename-tag
geddski.macros
gera2ld.markmap-vscode
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
hookyqr.minify
humao.rest-client
ionutvmi.path-autocomplete
jackiotyu.git-worktree-manager
jebbs.plantuml
johnpapa.vscode-peacock
k--kato.intellij-idea-keybindings
llvm-vs-code-extensions.lldb-dap
mechatroner.rainbow-csv
mehedidracula.php-namespace-resolver
misogi.ruby-rubocop
mrchetan.phpstorm-parameter-hints-in-vscode
mrmlnc.vscode-autoprefixer
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.makefile-tools
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
msjsdiag.vscode-react-native
natizyskunk.sftp
naumovs.color-highlight
neilbrayfield.php-docblocker
orta.vscode-jest
richie5um2.vscode-sort-json
romanpeshkov.vscode-text-tables
roscop.activefileinstatusbar
shopify.ruby-lsp
sianglim.slim
swiftlang.swift-vscode
sysoev.vscode-open-in-github
vincaslt.highlight-matching-tag
vscodevim.vim
xdebug.php-debug
