# Tap
tap "felixkratz/formulae", trusted: true
tap "manaflow-ai/cmux", trusted: true
tap "microsoft/apm", trusted: true
tap "mutagen-io/mutagen", trusted: true
tap "nikitabobko/tap", trusted: true

# シェル・ターミナル
brew "zsh"
brew "starship"
brew "herdr"
brew "tmux"
brew "bat"
brew "tree"
brew "ripgrep"

# 開発ツール
brew "gh"
brew "mise"
brew "graphviz"
brew "mkcert"
brew "microsoft/apm/apm"

# 言語・ランタイム
brew "php"
brew "ruby-build"
brew "cocoapods"

# Git・セキュリティ
brew "gnupg"
brew "pinentry-mac"

# コンテナ・同期
brew "mutagen-io/mutagen/mutagen-compose"

# ユーティリティ
brew "felixkratz/formulae/borders"

# GUIアプリ - 開発ツール
cask "manaflow-ai/cmux/cmux"
cask "copilot-cli"
cask "cursor"
cask "dash"
cask "ghostty"
cask "tableplus"
cask "visual-studio-code"

# GUIアプリ - AI
cask "chatgpt"
cask "claude"

# GUIアプリ - コミュニケーション
cask "discord"
cask "slack"
cask "zoom"

# GUIアプリ - ブラウザ
cask "firefox"
cask "google-chrome"

# GUIアプリ - ウィンドウ管理・ユーティリティ
cask "nikitabobko/tap/aerospace"
cask "jordanbaird-ice"
cask "raycast"
cask "scroll-reverser"

# GUIアプリ - その他
cask "1password"
cask "font-hack-nerd-font"
cask "obsidian"
cask "ticktick"
