# Tap
tap "felixkratz/formulae"
tap "k1low/tap"
tap "manaflow-ai/cmux"
tap "mutagen-io/mutagen"
tap "nikitabobko/tap"
tap "shuntaka9576/tap"

# シェル・ターミナル
brew "zsh"
brew "starship"
brew "tmux"
brew "bat"
brew "tree"
brew "ripgrep"

# 開発ツール
brew "gh"
brew "mise"
brew "graphviz"
brew "mkcert"

# 言語・ランタイム
brew "php"
brew "ruby-build"
brew "cocoapods"

# Git・セキュリティ
brew "gnupg"
brew "pinentry-mac"

# データベース
brew "postgresql@17"

# コンテナ・同期
brew "mutagen-io/mutagen/mutagen-compose"

# ユーティリティ
brew "ical-buddy"
brew "k1low/tap/mo"
brew "shuntaka9576/tap/agentoast-cli"
brew "felixkratz/formulae/borders"

# GUIアプリ
cask "nikitabobko/tap/aerospace"
cask "shuntaka9576/tap/agentoast"
cask "alt-tab"
cask "manaflow-ai/cmux/cmux"
cask "copilot-cli"
cask "font-hack-nerd-font"
cask "ghostty"
cask "jordanbaird-ice"
cask "ngrok"
cask "xcodes-app"
